COUPLE_COUNT_ICONS = {
    1: "1️⃣",
    2: "2️⃣",
    3: "3️⃣",
    4: "4️⃣",
    5: "5️⃣",
    6: "6️⃣",
    7: "7️⃣",
    8: "8️⃣",
    9: "9️⃣",
    0: "0️⃣"
}

DAY_ICONS = ["🎓", "💻", "📚", "🗓️", "🧰", "🏫"]

DISCIPLINE_ICONS = {
    "Математика": "🧮",
    "Физика": "🧲",
    "Химия": "🧪",
    "Биология": "🧬",
    "История": "🏛️",
    "Литература": "📚",
    "География": "🌎",
    "Информатика": "💻",
    "Экономика": "📈",
    "Право": "⚖️",
    "Социология": "👥",
    "Психология": "🧠",
    "Философия": "💭",
    "Искусство": "🎨",
    "Музыка": "🎶",
    "Физическая культура": "⚽",
    "Программирование": "💻",
    "Дизайн": "🎨",
    "Маркетинг": "📈",
    "Менеджмент": "💼",
    "Иностраный язык": "🇬🇧",
    "Русский язык": "🇷🇺",
    "Основы безопасности и защиты Родины": "🪖"
}

DAY_TYPES: list[str] = ["пн", "вт", "ср", "чт", "пт", "сб", "вс"]
MONTH_TYPES: list[str] = ["янв", "фев", "мар", "апр", "май", "июн", "июл", "авг", "сен", "окт", "ноя", "дек"]
